Ran Plan for dir: `service_deployment/core-user` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.deployment.github_repository.repo[0] has been changed
~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"61f43332cc056aa27155a9ffbf7a4f1c52327fbac2f658de23ac6ede47a26fd2\"" -> "W/\"e49ee07b79786d96192174fe278a9636fa72215d23d8962966b6fa09872f2887\""
        id                     = "avn-core-api"
        name                   = "avn-core-api"
        # (25 unchanged attributes hidden)
    }
  # module.deployment.aws_ecs_service.ecs_service has been changed
~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-southeast-2:714071859213:service/avn-dev-compute-ecs-cluster/avn-dev-core-api"
        name                               = "avn-dev-core-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-southeast-2:714071859213:task-definition/avn-dev-core-api:4" -> "arn:aws:ecs:ap-southeast-2:714071859213:task-definition/avn-dev-core-api:6"
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.deployment.data.template_file.container_definitions will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "container_definitions"  {
      ~ id       = "90dabbfefa70559be546f9ad1a4962c70026a8457ecb0fdac2383051e5158894" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - cpu               = 128
                  - essential         = true
                  - image             = "714071859213.dkr.ecr.ap-southeast-2.amazonaws.com/avn-dev-core-api-php:latest"
                  - memory            = 512
                  - memoryReservation = 128
                  - mountPoints       = []
                  - name              = "avn-dev-core-api-php"
                  - portMappings      = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom       = []
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          ~ "feature"            = "api" -> "user"
          ~ "image"              = "714071859213.dkr.ecr.ap-southeast-2.amazonaws.com/avn-dev-core-api-php" -> (known after apply)
            # (7 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.deployment.aws_appautoscaling_policy.autoscaling_policy[0] must be replaced
-/+ resource "aws_appautoscaling_policy" "autoscaling_policy" {
      ~ arn                = "arn:aws:autoscaling:ap-southeast-2:714071859213:scalingPolicy:7fde885f-aa80-4a26-9197-5852b3ec4686:resource/ecs/service/avn-dev-compute-ecs-cluster/avn-dev-core-api:policyName/avn-dev-core-api-autoscaling" -> (known after apply)
      ~ id                 = "avn-dev-core-api-autoscaling" -> (known after apply)
      ~ name               = "avn-dev-core-api-autoscaling" -> "avn-dev-core-user-autoscaling" # forces replacement
      ~ resource_id        = "service/avn-dev-compute-ecs-cluster/avn-dev-core-api" -> "service/avn-dev-compute-ecs-cluster/avn-dev-core-user" # forces replacement
        # (3 unchanged attributes hidden)

      ~ target_tracking_scaling_policy_configuration {
            # (4 unchanged attributes hidden)

          ~ predefined_metric_specification {
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.deployment.aws_appautoscaling_target.autscaling_target must be replaced
-/+ resource "aws_appautoscaling_target" "autscaling_target" {
      ~ id                 = "service/avn-dev-compute-ecs-cluster/avn-dev-core-api" -> (known after apply)
      ~ resource_id        = "service/avn-dev-compute-ecs-cluster/avn-dev-core-api" -> "service/avn-dev-compute-ecs-cluster/avn-dev-core-user" # forces replacement
      ~ role_arn           = "arn:aws:iam::714071859213:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.deployment.aws_codebuild_project.build_project must be replaced
-/+ resource "aws_codebuild_project" "build_project" {
      ~ arn                    = "arn:aws:codebuild:ap-southeast-2:714071859213:project/avn-dev-core-api" -> (known after apply)
      + badge_url              = (known after apply)
      - concurrent_build_limit = 0 -> null
      + description            = (known after apply)
      ~ encryption_key         = "arn:aws:kms:ap-southeast-2:714071859213:alias/aws/s3" -> (known after apply)
      ~ id                     = "arn:aws:codebuild:ap-southeast-2:714071859213:project/avn-dev-core-api" -> (known after apply)
      ~ name                   = "avn-dev-core-api" -> "avn-dev-core-user" # forces replacement
      ~ service_role           = "arn:aws:iam::714071859213:role/avn-dev-core-api-codebuild-role" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ artifacts {
          - name                   = "avn-dev-core-api" -> null
          - packaging              = "NONE" -> null
            # (3 unchanged attributes hidden)
        }

      ~ cache {
            # (2 unchanged attributes hidden)
        }

      ~ environment {
            # (5 unchanged attributes hidden)

          ~ environment_variable {
                name  = "SERVICE_NAME"
              ~ value = "avn-dev-core-api" -> "avn-dev-core-user"
                # (1 unchanged attribute hidden)
            }
          ~ environment_variable {
                name  = "REPOSITORY_URI_PHP_FPM"
              ~ value = "714071859213.dkr.ecr.ap-southeast-2.amazonaws.com/avn-dev-core-api-php" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ environment_variable {
                name  = "REPOSITORY_URI_NGINX"
              ~ value = "714071859213.dkr.ecr.ap-southeast-2.amazonaws.com/avn-dev-core-api-nginx" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ environment_variable {
                name  = "IMAGE_NAME_PHP_FPM"
              ~ value = "avn-dev-core-api-php" -> "avn-dev-core-user-php"
                # (1 unchanged attribute hidden)
            }
          ~ environment_variable {
                name  = "IMAGE_NAME_NGINX"
              ~ value = "avn-dev-core-api-nginx" -> "avn-dev-core-user-nginx"
                # (1 unchanged attribute hidden)
            }
            # (2 unchanged blocks hidden)
        }

      - logs_config {
          - cloudwatch_logs {
              - status = "ENABLED" -> null
            }

          - s3_logs {
              - encryption_disabled = false -> null
              - status              = "DISABLED" -> null
            }
        }

      ~ source {
          - git_clone_depth     = 0 -> null
          - insecure_ssl        = false -> null
          - report_build_status = false -> null
            # (2 unchanged attributes hidden)
        }

      ~ vpc_config {
          ~ security_group_ids = [
              - "sg-08ef532bc1016b85d",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.deployment.aws_codepipeline.codepipeline must be replaced
-/+ resource "aws_codepipeline" "codepipeline" {
      ~ arn      = "arn:aws:codepipeline:ap-southeast-2:714071859213:avn-dev-core-api" -> (known after apply)
      ~ id       = "avn-dev-core-api" -> (known after apply)
      ~ name     = "avn-dev-core-api" -> "avn-dev-core-user" # forces replacement
      ~ role_arn = "arn:aws:iam::714071859213:role/avn-dev-core-api-codepipeline-role" -> (known after apply)
      - tags     = {} -> null
      ~ tags_all = {} -> (known after apply)

      - artifact_store {
          - location = "avn-dev-storage-s3-pipeline" -> null
          - type     = "S3" -> null
        }
      + artifact_store {
          + location = "avn-dev-storage-s3-pipeline"
          + region   = (known after apply)
          + type     = "S3"
        }

      ~ stage {
            name = "Source"

          ~ action {
              ~ configuration    = {
                  ~ "Repo"                 = "avn-core-api" -> "avn-core-user"
                    # (4 unchanged elements hidden)
                }
              - input_artifacts  = [] -> null
                name             = "Source"
              - namespace        = "" -> null
              ~ region           = "" -> (known after apply)
              - role_arn         = "" -> null
              ~ run_order        = 1 -> (known after apply)
                # (5 unchanged attributes hidden)
            }
        }
      ~ stage {
            name = "Build"

          ~ action {
              ~ configuration    = {
                  ~ "ProjectName" = "avn-dev-core-api" -> "avn-dev-core-user"
                }
                name             = "Build"
              + region           = (known after apply)
              ~ run_order        = 1 -> (known after apply)
                # (6 unchanged attributes hidden)
            }
        }
      ~ stage {
            name = "Deploy"

          ~ action {
              ~ configuration    = {
                  ~ "FileName"    = "avn-dev-core-api.json" -> "avn-dev-core-user.json"
                  ~ "ServiceName" = "avn-dev-core-api" -> "avn-dev-core-user"
                    # (1 unchanged element hidden)
                }
                name             = "Deploy"
              - output_artifacts = [] -> null
              + region           = (known after apply)
              ~ run_order        = 1 -> (known after apply)
                # (5 unchanged attributes hidden)
            }
        }
    }

  # module.deployment.aws_codepipeline_webhook.codepipeline_webhook must be replaced
-/+ resource "aws_codepipeline_webhook" "codepipeline_webhook" {
      ~ id              = "arn:aws:codepipeline:ap-southeast-2:714071859213:webhook:webhook-codepipeline-avn-dev-core-api" -> (known after apply)
      ~ name            = "webhook-codepipeline-avn-dev-core-api" -> "webhook-codepipeline-avn-dev-core-user" # forces replacement
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
      ~ target_pipeline = "avn-dev-core-api" -> "avn-dev-core-user" # forces replacement
      ~ url             = "https://ap-southeast-2.webhooks.aws/trigger?t=eyJlbmNyeXB0ZWREYXRhIjoiVk50MWdwVVdyVFpzWWIyYzRSMzdHenhncWRyemdIMHNncEE4YkQ4MGdqVlVMaFl4N3AwOWNKdCtZUGh0N05aMmhpdlUva0Z0T3BTR0VkNjk3R3lMRlVkcHdQMDg1QSt3V1VKdE0yTHU4OEg2YVdtbXZ2TEJFZTNHY2VBYmY0ZkhkK0w4NjIxdzROMFdJdzY5Ui9IQzA5NGdEcHZ4aTUrMlg3V1Z5UnltSjc5RW1BPT0iLCJpdlBhcmFtZXRlclNwZWMiOiIrd0w1QWtxN2h5czhLd3VzIiwibWF0ZXJpYWxTZXRTZXJpYWwiOjF9&v=1" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ authentication_configuration {
          ~ secret_token = (sensitive value) # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # module.deployment.aws_ecr_lifecycle_policy.ecr_policy_nginx must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "ecr_policy_nginx" {
      ~ id          = "avn-dev-core-api-nginx" -> (known after apply)
      ~ policy      = jsonencode( # whitespace changes
            {
                rules = [
                    {
                        action       = {
                            type = "expire"
                        }
                        description  = "Remove image more than 10"
                        rulePriority = 1
                        selection    = {
                            countNumber = 10
                            countType   = "imageCountMoreThan"
                            tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      ~ registry_id = "714071859213" -> (known after apply)
      ~ repository  = "avn-dev-core-api-nginx" -> "avn-dev-core-user-nginx" # forces replacement
    }

  # module.deployment.aws_ecr_lifecycle_policy.ecr_policy_php must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "ecr_policy_php" {
      ~ id          = "avn-dev-core-api-php" -> (known after apply)
      ~ policy      = jsonencode( # whitespace changes
            {
                rules = [
                    {
                        action       = {
                            type = "expire"
                        }
                        description  = "Remove image more than 10"
                        rulePriority = 1
                        selection    = {
                            countNumber = 10
                            countType   = "imageCountMoreThan"
                            tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      ~ registry_id = "714071859213" -> (known after apply)
      ~ repository  = "avn-dev-core-api-php" -> "avn-dev-core-user-php" # forces replacement
    }

  # module.deployment.aws_ecr_repository.ecr_nginx must be replaced
-/+ resource "aws_ecr_repository" "ecr_nginx" {
      ~ arn                  = "arn:aws:ecr:ap-southeast-2:714071859213:repository/avn-dev-core-api-nginx" -> (known after apply)
      ~ id                   = "avn-dev-core-api-nginx" -> (known after apply)
      ~ name                 = "avn-dev-core-api-nginx" -> "avn-dev-core-user-nginx" # forces replacement
      ~ registry_id          = "714071859213" -> (known after apply)
      ~ repository_url       = "714071859213.dkr.ecr.ap-southeast-2.amazonaws.com/avn-dev-core-api-nginx" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

  # module.deployment.aws_ecr_repository.ecr_php must be replaced
-/+ resource "aws_ecr_repository" "ecr_php" {
      ~ arn                  = "arn:aws:ecr:ap-southeast-2:714071859213:repository/avn-dev-core-api-php" -> (known after apply)
      ~ id                   = "avn-dev-core-api-php" -> (known after apply)
      ~ name                 = "avn-dev-core-api-php" -> "avn-dev-core-user-php" # forces replacement
      ~ registry_id          = "714071859213" -> (known after apply)
      ~ repository_url       = "714071859213.dkr.ecr.ap-southeast-2.amazonaws.com/avn-dev-core-api-php" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

  # module.deployment.aws_ecs_service.ecs_service must be replaced
-/+ resource "aws_ecs_service" "ecs_service" {
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ap-southeast-2:714071859213:service/avn-dev-compute-ecs-cluster/avn-dev-core-api" -> (known after apply)
      ~ name                               = "avn-dev-core-api" -> "avn-dev-core-user" # forces replacement
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ task_definition                    = "arn:aws:ecs:ap-southeast-2:714071859213:task-definition/avn-dev-core-api:6" -> (known after apply)
        # (9 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer { # forces replacement
          - container_name   = "avn-dev-core-api-php" -> null
          - container_port   = 80 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:targetgroup/avn-dev-core-api-tg/0c2316cbcf840096" -> null
        }
      + load_balancer { # forces replacement
          + container_name   = "avn-dev-core-user-php"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-08ef532bc1016b85d",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.deployment.aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:ap-southeast-2:714071859213:task-definition/avn-dev-core-api:4" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu               = 128
                  - environment       = []
                  - essential         = true
                  - image             = "714071859213.dkr.ecr.ap-southeast-2.amazonaws.com/avn-dev-core-api-php:latest"
                  - memory            = 512
                  - memoryReservation = 128
                  - mountPoints       = []
                  - name              = "avn-dev-core-api-php"
                  - portMappings      = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom       = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ execution_role_arn       = "arn:aws:iam::714071859213:role/avn-dev-core-api-task-execution-role" -> (known after apply) # forces replacement
      ~ family                   = "avn-dev-core-api" -> "avn-dev-core-user" # forces replacement
      ~ id                       = "avn-dev-core-api" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
      ~ task_role_arn            = "arn:aws:iam::714071859213:role/avn-dev-core-api-task-role" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.deployment.aws_iam_role.codebuild_role must be replaced
-/+ resource "aws_iam_role" "codebuild_role" {
      ~ arn                   = "arn:aws:iam::714071859213:role/avn-dev-core-api-codebuild-role" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "codebuild.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2021-09-08T06:49:50Z" -> (known after apply)
      ~ id                    = "avn-dev-core-api-codebuild-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> (known after apply)
      ~ name                  = "avn-dev-core-api-codebuild-role" -> "avn-dev-core-user-codebuild-role" # forces replacement
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2MQP74AGSWVHHIFGY" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.deployment.aws_iam_role.codepipeline_role must be replaced
-/+ resource "aws_iam_role" "codepipeline_role" {
      ~ arn                   = "arn:aws:iam::714071859213:role/avn-dev-core-api-codepipeline-role" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "codepipeline.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2021-09-08T06:49:50Z" -> (known after apply)
      ~ id                    = "avn-dev-core-api-codepipeline-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> (known after apply)
      ~ name                  = "avn-dev-core-api-codepipeline-role" -> "avn-dev-core-user-codepipeline-role" # forces replacement
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2MQP74AG6WBZ3CVWJ" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.deployment.aws_iam_role.task_execution_role must be replaced
-/+ resource "aws_iam_role" "task_execution_role" {
      ~ arn                   = "arn:aws:iam::714071859213:role/avn-dev-core-api-task-execution-role" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "ecs-tasks.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2021-09-08T06:43:55Z" -> (known after apply)
      ~ id                    = "avn-dev-core-api-task-execution-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "avn-dev-core-api-task-execution-role" -> "avn-dev-core-user-task-execution-role" # forces replacement
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2MQP74AG4UGD444B3" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "avn-dev-core-api-task-exeuction-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "ecr:GetAuthorizationToken",
                              - "ecr:BatchCheckLayerAvailability",
                              - "ecr:GetDownloadUrlForLayer",
                              - "ecr:BatchGetImage",
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                              - "ssm:Describe*",
                              - "ssm:Get*",
                              - "ssm:List*",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.deployment.aws_iam_role.task_role must be replaced
-/+ resource "aws_iam_role" "task_role" {
      ~ arn                   = "arn:aws:iam::714071859213:role/avn-dev-core-api-task-role" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "ecs-tasks.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2021-09-08T06:43:55Z" -> (known after apply)
      ~ id                    = "avn-dev-core-api-task-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "avn-dev-core-api-task-role" -> "avn-dev-core-user-task-role" # forces replacement
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2MQP74AG4TTGKXXQX" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "avn-dev-core-api-policy-name" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "s3:GetObjectAcl",
                              - "s3:GetObject",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "*",
                            ]
                          - Sid      = "Stmt1630978762833"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.deployment.aws_iam_role_policy.task_execution_policy must be replaced
-/+ resource "aws_iam_role_policy" "task_execution_policy" {
      ~ id     = "avn-dev-core-api-task-execution-role:avn-dev-core-api-task-exeuction-policy" -> (known after apply)
      ~ name   = "avn-dev-core-api-task-exeuction-policy" -> "avn-dev-core-user-task-exeuction-policy" # forces replacement
      ~ role   = "avn-dev-core-api-task-execution-role" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.deployment.aws_iam_role_policy.task_policy must be replaced
-/+ resource "aws_iam_role_policy" "task_policy" {
      ~ id     = "avn-dev-core-api-task-role:avn-dev-core-api-policy-name" -> (known after apply)
      ~ name   = "avn-dev-core-api-policy-name" -> "avn-dev-core-user-policy-name" # forces replacement
      ~ role   = "avn-dev-core-api-task-role" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.deployment.aws_iam_role_policy_attachment.codebuild_attach_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "codebuild_attach_policy" {
      ~ id         = "avn-dev-core-api-codebuild-role-20210908064955466300000002" -> (known after apply)
      ~ role       = "avn-dev-core-api-codebuild-role" -> "avn-dev-core-user-codebuild-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.deployment.aws_iam_role_policy_attachment.codepipeline_attach_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "codepipeline_attach_policy" {
      ~ id         = "avn-dev-core-api-codepipeline-role-20210908064955466100000001" -> (known after apply)
      ~ role       = "avn-dev-core-api-codepipeline-role" -> "avn-dev-core-user-codepipeline-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.deployment.aws_lb_listener.nlb_http_listener will be updated in-place
~ resource "aws_lb_listener" "nlb_http_listener" {
        id                = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:listener/net/avn-dev-compute-ecs-nlb/e71b6466f0f517b8/7e7e46271d734280"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:targetgroup/avn-dev-core-api-tg/0c2316cbcf840096" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.deployment.aws_lb_target_group.nlb_tg must be replaced
-/+ resource "aws_lb_target_group" "nlb_tg" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:targetgroup/avn-dev-core-api-tg/0c2316cbcf840096" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/avn-dev-core-api-tg/0c2316cbcf840096" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ap-southeast-2:714071859213:targetgroup/avn-dev-core-api-tg/0c2316cbcf840096" -> (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      ~ name                               = "avn-dev-core-api-tg" -> "avn-dev-core-user-tg" # forces replacement
      ~ preserve_client_ip                 = "false" -> (known after apply)
      + protocol_version                   = (known after apply)
      ~ tags                               = {
          ~ "Feature" = "api-tg" -> "user-tg"
          ~ "Name"    = "avn-dev-core-api-tg" -> "avn-dev-core-user-tg"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                           = {
          ~ "Feature" = "api-tg" -> "user-tg"
          ~ "Name"    = "avn-dev-core-api-tg" -> "avn-dev-core-user-tg"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

      ~ health_check {
          + matcher             = (known after apply)
          + path                = (known after apply)
          ~ timeout             = 10 -> (known after apply)
            # (6 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 0 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "source_ip" -> (known after apply)
        }
    }

  # module.deployment.aws_secretsmanager_secret.secret must be replaced
-/+ resource "aws_secretsmanager_secret" "secret" {
      ~ arn                            = "arn:aws:secretsmanager:ap-southeast-2:714071859213:secret:avn-dev-core-api-NruhBk" -> (known after apply)
      ~ id                             = "arn:aws:secretsmanager:ap-southeast-2:714071859213:secret:avn-dev-core-api-NruhBk" -> (known after apply)
      ~ name                           = "avn-dev-core-api" -> "avn-dev-core-user" # forces replacement
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      ~ rotation_enabled               = false -> (known after apply)
      + rotation_lambda_arn            = (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
        # (3 unchanged attributes hidden)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.deployment.aws_secretsmanager_secret_version.secret_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "secret_version" {
      ~ arn            = "arn:aws:secretsmanager:ap-southeast-2:714071859213:secret:avn-dev-core-api-NruhBk" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ap-southeast-2:714071859213:secret:avn-dev-core-api-NruhBk|1D405C94-B06B-4207-9D50-E7C735D866A1" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_id      = "arn:aws:secretsmanager:ap-southeast-2:714071859213:secret:avn-dev-core-api-NruhBk" -> (known after apply) # forces replacement
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "1D405C94-B06B-4207-9D50-E7C735D866A1" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
    }

  # module.deployment.aws_security_group.sg must be replaced
-/+ resource "aws_security_group" "sg" {
      ~ arn                    = "arn:aws:ec2:ap-southeast-2:714071859213:security-group/sg-08ef532bc1016b85d" -> (known after apply)
      ~ description            = "Security Group for avn-dev-core-api service" -> "Security Group for avn-dev-core-user service" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow egress all protocol avn-dev-core-api service"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-08ef532bc1016b85d" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow ingress http for avn-dev-core-api service"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> (known after apply)
      ~ name                   = "avn-dev-core-api-sg" -> "avn-dev-core-user-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "714071859213" -> (known after apply)
      ~ tags                   = {
          ~ "Feature" = "api" -> "user"
          ~ "Name"    = "avn-dev-core-api-sg" -> "avn-dev-core-user-sg"
            # (2 unchanged elements hidden)
        }
      ~ tags_all               = {
          ~ "Feature" = "api" -> "user"
          ~ "Name"    = "avn-dev-core-api-sg" -> "avn-dev-core-user-sg"
            # (2 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.deployment.aws_security_group_rule.sg_eg_all must be replaced
-/+ resource "aws_security_group_rule" "sg_eg_all" {
      ~ description              = "Allow egress all protocol avn-dev-core-api service" -> "Allow egress all protocol avn-dev-core-user service"
      ~ id                       = "sgrule-2590855469" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-08ef532bc1016b85d" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.deployment.aws_security_group_rule.sg_in_tcp must be replaced
-/+ resource "aws_security_group_rule" "sg_in_tcp" {
      ~ description              = "Allow ingress http for avn-dev-core-api service" -> "Allow ingress http for avn-dev-core-user service"
      ~ id                       = "sgrule-869200522" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-08ef532bc1016b85d" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.deployment.aws_ssm_parameter.role_arn must be replaced
-/+ resource "aws_ssm_parameter" "role_arn" {
      ~ arn       = "arn:aws:ssm:ap-southeast-2:714071859213:parameter/avn/dev/secret/core/api/IAM_ROLE_ARN" -> (known after apply)
      ~ data_type = "text" -> (known after apply)
      ~ id        = "/avn/dev/secret/core/api/IAM_ROLE_ARN" -> (known after apply)
      ~ name      = "/avn/dev/secret/core/api/IAM_ROLE_ARN" -> "/avn/dev/secret/core/user/IAM_ROLE_ARN" # forces replacement
      - tags      = {} -> null
      ~ tags_all  = {} -> (known after apply)
      ~ value     = (sensitive value)
      ~ version   = 1 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.deployment.github_branch.dev[0] must be replaced
-/+ resource "github_branch" "dev" {
      ~ etag          = "W/\"b96ae6be16dd7e6214961edb1ce80b46b3400cdf5ca2b85165f5033764062c3b\"" -> (known after apply)
      ~ id            = "avn-core-api:dev" -> (known after apply)
      ~ ref           = "refs/heads/dev" -> (known after apply)
      ~ repository    = "avn-core-api" -> "avn-core-user" # forces replacement
      ~ sha           = "67255e89c9fc0daf873f67440731588b611503ee" -> (known after apply)
      ~ source_sha    = "67255e89c9fc0daf873f67440731588b611503ee" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.deployment.github_repository.repo[0] will be updated in-place
~ resource "github_repository" "repo" {
      ~ description            = "Repository for avn-core-api service" -> "Repository for avn-core-user service"
        id                     = "avn-core-api"
      ~ name                   = "avn-core-api" -> "avn-core-user"
        # (25 unchanged attributes hidden)
    }

  # module.deployment.github_repository_webhook.github_webhook must be replaced
-/+ resource "github_repository_webhook" "github_webhook" {
      + etag       = (known after apply)
      ~ id         = "317112835" -> (known after apply)
      ~ repository = "avn-core-api" -> "avn-core-user" # forces replacement
      ~ url        = "https://api.github.com/repos/greyhats13/avn-core-api/hooks/317112835" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ configuration {
          ~ secret       = (sensitive value)
          ~ url          = (sensitive value)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 28 to add, 2 to change, 28 to destroy.

Warning: The CodePipeline GitHub version 1 action provider is deprecated.

  with module.deployment.aws_codepipeline.codepipeline,
  on ../../modules/deployment/codepipeline.tf line 39, in resource "aws_codepipeline" "codepipeline":
  39:       provider         = "GitHub"

Use a GitHub version 2 action (with a CodeStar Connection
`aws_codestarconnections_connection`) instead. See
https://docs.aws.amazon.com/codepipeline/latest/userguide/update-github-action-connections.html

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d service_deployment/core-user`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.blast.co.id/lock?id=greyhats13%252Favana-aws-infra%252Fservice_deployment%252Fcore-user%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d service_deployment/core-user`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 28 to add, 2 to change, 28 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
